{
    "label_home": "Inicio",
    "label_title": "Bienvenido a mi blog profesional",
    "label_description": "游빐 Gracias por visitar mi espacio profesional. Actualmente me encuentro en b칰squeda activa de nuevos retos profesionales donde pueda aplicar mis habilidades y aportar valor real a la empresa, contribuyendo de manera significativa y con impacto en la sociedad.\nSoy Ingeniero en Inform치tica con 6 a침os de experiencia en desarrollo full-stack, especializado en Java y Python. Durante los 칰ltimos dos a침os, me he enfocado en backend con Spring Boot, JPA y Hibernate, desarrollando APIs escalables y seguras. Tambi칠n tengo experiencia con FastAPI y Flask, construyendo APIs de alto rendimiento en Python.\nHe trabajado con procesamiento de datos, web scraping, tratamiento de im치genes digitales y manipulaci칩n de datos con Pandas. Manejo bases de datos relacionales como MySQL, Oracle y SQLite, as칤 como MongoDB en entornos NoSQL.\nEn cuanto a la calidad del software, cuento con experiencia en pruebas automatizadas con JUnit, Mockito y Cucumber, adem치s de herramientas como SonarQube y Dependency-Track. Tambi칠n he gestionado pipelines de CI/CD con Jenkins.\nEn el frontend, tengo conocimientos en Angular y TypeScript, as칤 como automatizaci칩n de pruebas usando Selenium y Python.\nMe considero una persona proactiva, adaptable y orientada al crecimiento, con experiencia en metodolog칤as 치giles (Scrum, Kanban) y acostumbrado a entornos din치micos. Mi pasi칩n por la tecnolog칤a me impulsa a evolucionar constantemente, explorar nuevas tendencias y llevar cada soluci칩n al siguiente nivel.\nMientras contin칰o en esta b칰squeda activa de empleo, he aprovechado el tiempo para seguir form치ndome, realizando los cursos de Principios SOLID y Clean Code (Udemy) y Advanced Python Programming. Puedes consultar estos y otros detalles en el apartado Formaci칩n de este blog, que estoy desarrollando con Python, Flask y Jinja2. El c칩digo fuente del blog est치 disponible p칰blicamente en mi repositorio de GitHub.\nEstoy disponible para incorporaci칩n inmediata y abierto a conectar con equipos que compartan esta visi칩n."
}