[
    {
        "title": "Cybersecurity-focused solutions – INCIBE.",
        "rol": "Fullstack Developer",
        "date": "01/2023 - 02/2025",
        "company": "Mnemo, client INCIBE (Spanish National Cybersecurity Institute).",
        "description": "I worked as a fullstack developer in the field of cybersecurity for the Spanish National Cybersecurity Institute (INCIBE), through the consulting firm Mnemo. I contributed to the design, development, and maintenance of secure web applications focused on threat intelligence and cybersecurity awareness. My work included backend development with Java (Spring Boot, JPA, Hibernate) and Python (FastAPI), as well as frontend development with Angular and TypeScript. I implemented RESTful APIs, CI/CD pipelines, and participated in agile sprints, with a strong focus on code quality and security. The role required high attention to detail due to the critical nature of the services provided to the public sector and Spanish citizens.",
        "technologies": ["Java", "Spring Boot", "JPA", "Hibernate", "Python", "FastAPI", "Angular", "TypeScript", "PostgreSQL", "MongoDB", "Elasticsearch", "Prometheus", "Grafana", "Git", "Jenkins", "SonarQube", "Docker", "Scrum"]
    },
    {
        "title": "Eat-Me: Augmented Reality Menu Application",
        "rol": "Application Designer and Developer",
        "date": "12/2020 - 12/2022",
        "company": "MEP-Projects",
        "description": "I designed and developed Eat-Me, an augmented reality application that allows restaurants to showcase their menu dishes innovatively using the customer's mobile device. By pointing at a visual marker on the table, diners can view realistic 3D models of the dishes before placing their order. The project was created for the HORECA sector and received recognition from the Basque Culinary Center. The app was published on Google Play and the App Store, with backend services and model hosting managed through AWS.",
        "technologies": ["Unity", "C#", "Vuforia", "MongoDB", "AWS (S3)", "Augmented Reality", "Google Play", "App Store"]
    },
    {
        "title": "PRISMA – Scientific Research Platform of the University of Seville",
        "rol": "Design and development of automated data extraction and cleaning processes with Python. Web development of the frontend and support for integrating scientific data from PDI.",
        "date": "12/2019 - 12/2020",
        "company": "Bibliometrics Unit, University of Seville",
        "description": "I collaborated in the development and improvement of the PRISMA platform (https://prisma.us.es/), a web application that centralizes and organizes the scientific production of the PDI (Teaching and Research Staff) at the University of Seville. My tasks included data collection, cleaning, and structuring from multiple sources and formats (CSV, Excel, XML, JSON), as well as automating the extraction of additional data using web scraping techniques with Python. I used Pandas to structure the data for easier subsequent analysis. I also participated in implementing the frontend using HTML5, JavaScript, and PHP, creating an accessible interface that allows users to query publications, theses, projects, and associated metrics. This tool facilitates the generation of standardized CVs (CVN/CVA) and improves the visibility of scientific production in calls like FECYT, National Plan, or Carlos III Institute.",
        "technologies": ["Python", "Pandas", "Web Scraping", "HTML5", "JavaScript", "PHP", "CSV", "Excel", "JSON", "XML"]
    },
    {
        "title": "Automation of Working Hours Registration for Employees",
        "rol": "Application Designer and Developer",
        "date": "03/2021 - 09/2022",
        "company": "MEP-Projects",
        "description": "I developed software that allows companies to keep an accurate and automated record of working hours for each employee, both in-office and remote work. The tool includes features for assigning hours to specific tasks or projects, facilitating up-to-date cost center tracking based on time spent by the team. This system helps improve operational efficiency and internal financial control.",
        "technologies": ["Python", "Tkinter", "SQLite", "Automation", "Time Management", "Cost Tracking", "Desktop App"]
    },
    {
        "title": "Automation Script for Instagram and Social Media Management",
        "rol": "Application Designer and Developer",
        "date": "06/2021 - 12/2021",
        "company": "MEP-Projects",
        "description": "An innovative tool designed to support Community Management teams, automating content creation and social media management on Instagram. The script generates personalized content using advanced algorithms that consider demographic data and audience preferences. It creates posts, text, and visual proposals aligned with the brand identity. It also includes features like automatic messaging, scheduled replies, and a publishing calendar for efficient planning.",
        "technologies": ["Python", "Tkinter", "Selenium", "BeautifulSoup", "Pandas", "Instagram API", "Natural Language Processing (NLP)", "Task Scheduling Libraries (like APScheduler)", "JSON", "Automation Scripts"]
    },
    {
        "title": "Automation of Functional Testing and Security Audits for Banking Entities",
        "rol": "Quality Analyst Tester",
        "date": "07/2018 - 03/2019",
        "company": "Sopra Steria, SA",
        "description": "As a QA Tester at Sopra Steria, I participated in projects for various banking entities, designing and executing functional test cases, developing process automation scripts, and conducting security audits through manual testing and automated scans. I contributed to ensuring software quality, improving testing efficiency, and identifying critical vulnerabilities in banking systems.",
        "technologies": ["HP ALM", "Jira", "Selenium", "Python", "TestLink", "Postman", "OWASP ZAP", "Agile Methodologies (Scrum)", "Functional Testing", "Test Automation", "Security Scanners"]
    },
    {
        "title": "Support Project for Systemic Treatment and Radiotherapy Dosage",
        "rol": "Research Intern",
        "date": "04/2018 - 06/2018",
        "company": "Virgen del Rocío University Hospital, Seville",
        "description": "Participation in a project funded by the Carlos III Health Institute focused on treatments for lung cancer patients. Collaboration in studying and analyzing hospital data related to patients undergoing chemotherapy and radiotherapy. Reorganization of a previously disorganized database from free-text to a well-designed relational model. Data organization to allow more efficient queries, facilitating clinical studies and patient follow-up. Application of basic data mining techniques in the hospital environment. Development of a WordPress platform for centralized management of content from various innovation group projects.",
        "technologies": ["MySQL", "SQL", "Python", "BeautifulSoup", "Selenium", "Pandas", "PHP", "HTML", "JavaScript", "CSS", "jQuery", "Bootstrap", "Apache HTTP Server", "WordPress", "Data Mining"]
    }
]
